In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({
    'nombre': ['Ana', 'Juan', 'Luis', 'Pedro', 'Silvina'],
    'email': ['ana@ejemplo.com', 'juan@ejemplo.com', 'luis@ejemplo.com', 'pedro@ejemplo.com', 'silvina@ejemplo.com'],
    'edad': [22, 37, 15, 49, 63],
    'ubicacion': ['Ciudad A', 'Ciudad B', 'Ciudad C', 'Ciudad D', 'Ciudad E'],
    'salario': [55000, 34000, 76000, 51000, 62000],
    'banco': ['Banco 1', 'Banco 3', 'Banco 1', 'Banco 2', 'Banco 3']
})

data

    nombre                email  edad ubicacion  salario    banco
0      Ana      ana@ejemplo.com    22  Ciudad A    55000  Banco 1
1     Juan     juan@ejemplo.com    37  Ciudad B    34000  Banco 3
2     Luis     luis@ejemplo.com    15  Ciudad C    76000  Banco 1
3    Pedro    pedro@ejemplo.com    49  Ciudad D    51000  Banco 2
4  Silvina  silvina@ejemplo.com    63  Ciudad E    62000  Banco 3

In [4]:
data.drop(['nombre' ,'email'], axis=1, inplace=True)

In [6]:
data

   edad ubicacion  salario    banco
0    22  Ciudad A    55000  Banco 1
1    37  Ciudad B    34000  Banco 3
2    15  Ciudad C    76000  Banco 1
3    49  Ciudad D    51000  Banco 2
4    63  Ciudad E    62000  Banco 3

In [7]:
data['edad'] = (data['edad'] // 10) * 10

In [8]:
data

   edad ubicacion  salario    banco
0    20  Ciudad A    55000  Banco 1
1    30  Ciudad B    34000  Banco 3
2    10  Ciudad C    76000  Banco 1
3    40  Ciudad D    51000  Banco 2
4    60  Ciudad E    62000  Banco 3

In [11]:
noise = np.random.normal(0, 100, size=data['salario'].shape)

In [12]:
noise

array([-172.0498421 ,   10.32944608, -102.90613281,   -2.91698985,
         56.09602499])

In [14]:
data['salario'] += noise
data['salario']

0    54827.950158
1    34010.329446
2    75897.093867
3    50997.083010
4    62056.096025
Name: salario, dtype: float64

In [15]:
data['banco'] = np.random.permutation(data['banco'])
data

   edad ubicacion       salario    banco
0    20  Ciudad A  54827.950158  Banco 2
1    30  Ciudad B  34010.329446  Banco 3
2    10  Ciudad C  75897.093867  Banco 3
3    40  Ciudad D  50997.083010  Banco 1
4    60  Ciudad E  62056.096025  Banco 1